#ifndef _MUSIC_LAB_H
#define _MUSIC_LAB_H
#include "Music.h"

/*我和我的祖国*/
const int Motherland[]=
{
		H1, T/8, H2, T/8, H3, T/8, H2, T/8, H1, T/8, M6, T/8 , M7, T/8 , M6, T/8, M3, T/16, M5, T/4, M5, T/4,
		H1, T/8, H2, T/8, H3, T/8, H2, T/8, H1, T/8, M6, T/8 , M7, T/8 , M5, T/8, M3, T/16, M6, T/8, M6, T/4,
		M5, T/8, M4, T/8, M3, T/8, M2, T/4, M1, T/8, M1, T/4 ,                      /*前奏*/
		M5, T/8, M6, T/8, M5, T/8, M4, T/8, M3, T/8, M2, T/8 , M1, T/4 , L5, T/4,   /*我和我的祖国*/
		M1, T/8, M3, T/8, H1, T/8, M7, T/8, M6, T/8, M3, T/16, M5, T/4 , M5, T/4,   /*一刻也不能分割*/
		M6, T/8, M7, T/8, M6, T/8, M5, T/8, M4, T/8, M3, T/8 , M2, T/4 , L6, T/4,   /*无论我走到哪里*/
		M7, T/8, M6, T/8, M5, T/8, M5, T/8, M1, T/8, M2, T/16, M3, T/4 , M3, T/4,   /*都流出一首赞歌*/
		M5, T/8, M6, T/8, M5, T/8, M4, T/8, M3, T/8, M2, T/8 , M1, T/4 , L5, T/4,   /*我歌唱每一座高山*/
		M1, T/8, M3, T/8, H1, T/8, M7, T/8, H2, T/8, H1, T/16, M6, T/4 , M6, T/4,   /*我歌唱每一条河*/
		H1, T/8, M7, T/8, M5, T/8, M5, T/4, M6, T/8, M5, T/8 , M4, T/8 , M3, T/4, L7, T/4 , L6, T/8, L5, T/4, M2, T/8, M1, T/4, M5, T/4, /*袅袅翠烟，小小村落，路上一道辙*/
		H1, T/8, H2, T/8, H3, T/8, H2, T/8, H1, T/8, M6, T/8 , M7, T/8 , M6, T/8, M3, T/16, M5, T/4, M5, T/4,                           /*我最亲爱的祖国*/
		H1, T/8, H2, T/8, H3, T/8, H2, T/8, H1, T/8, M6, T/8 , M7, T/8 , M6, T/8, M3, T/16, M6, T/4, M6, T/4,                           /*我永远紧依着你的心窝*/
		M5, T/8, M4, T/8, M3, T/8, M2, T/4, L7, T/8, L6, T/16, L6, T/16, L5, T/8, M3, T/4 , M2, T/4, M1, T/8, M1, T/4, M1, T/4,         /*你用你那母亲的脉搏和我诉说*/
		H1, T/8, H2, T/8, H3, T/8, H2, T/8, H1, T/8, M6, T/8 , M7, T/8 , M6, T/8, M3, T/16, M5, T/4, M5, T/4,                           /*我最亲爱的祖国*/
		H1, T/8, H2, T/8, H3, T/8, H2, T/8, H1, T/8, M6, T/8 , M7, T/8 , M5, T/8, M3, T/16, M6, T/8, M6, T/4,                           /*你是大海永不干涸*/
		M5, T/8, M4, T/8, M3, T/8, M2, T/4, L7, T/8, L6, T/16, L5, T/8 , M3, T/4, M5, T/4 , M2, T/4, M1, T/8, M1, T/4                   /* 永远给我 碧浪清波 心中的歌*/
};

/*生日快乐*/
const int HappyBirthday[]=
{
	L5, T/8, L5, T/8, L6, T/4, L5, T/4, M1, T/4, L7, T/2,
	L5, T/8, L5, T/8, L6, T/4, L5, T/4, M2, T/4, M1, T/2,
	L5, T/8, L5, T/8, M5, T/4, M3, T/4, M1, T/4, L7, T/4, L6, T/2,
	M4, T/8, M4, T/8, M3, T/4, M1, T/4, M2, T/4, M1, T/2
};

/*钢铁洪流曲*/
const int SteelTorrent[]=
{  
  	M6, T/2, M6, T/2 , M6, T/2 , M6, T/2 , M7, T/2 , H1, T/2, H2, T/2, H1, T/2, M7, T/2, H1, T/2,
		M6, T/2, M6, T/2 , M6, T/2 , M6, T/2 , M7, T/2 , H1, T/2, H2, T/2, H1, T/2, H2, T/2, H3, T/2, M6, T/2, M7, T/2, M7, T/2,
		M6, T/8, M6, T/16, M6, T/16, M6, T/2 , M6, T/2 , M6, T/4, M3, T/4, M6, T/4,
	  M7, T/4, H1, T/8 , H1, T/8 , H1, T/8 , H1, T/2 , H1, T/2, H1, T/4, H2, T/4, M5, T/2, M5, T/2,
	  M4, T/2, M3, T/2 , M2, T/2 , M2, T/2 , M2, T/2 , M2, T/2,
		M6, T/8, M6, T/16, M6, T/16, M6, T/2 , M6, T/2 , M6, T/8, M3, T/4, M6, T/8, M7, T/8, H1, T/8, H1, T/16, H1, T/16,
	  H1, T/2, H1, T/2 , H1, T/4 , M2, T/4 , M5, T/2 , M5, T/2, M5, T/4, M3, T/4, M4, T/4, M5, T/4, M6, T/2 , M6, T/2,
		M7, T/2, M7, T/2 , H1, T/8 , H1, T/16, H1, T/16, H1, T/2, H1, T/2, H1, T/4, M6, T/4, H1, T/4, H3, T/4 ,
		H4, T/8, H4, T/16, H4, T/16, H4, T/2 , H4, T/2 , H4, T/4, M1, T/4, H3, T/2, H3, T/2, H3, T/4, M5, T/4 , 
		M7, T/4, H1, T/4 , H2, T/2 , H2, T/2 , H1, T/2 , M7, T
};



const int TheDawn[]=
{
	M6,T/16,M7,T/16,H1,T/8*3,M6,T/16,M7,T/16,                          H1,T/8*3,M7,T/16,M6,T/16,M7,T/4,M7,T/16,M3,T/16,H1,T/16,M7,T/16,     M6,T/4,M6,T/16,M6,T/16,M7,T/16,M6,T/16,H4,T/8*3,H3,T/16,H2,T/16,
	H3,T/8*3,H2,T/16,H1,T/16,H2,T/8*3,H3,T/8,                          H4,T/8*3,H3,T/16,H2,T/16,H7,T/8*3,H6,T/16,H5,T/16,                   H6,T/8*3,H5,T/16,H4,T/16,H5,T/4,H4,T/8,H3,T/8,
	H3,T/8,H4,T/8,H2,T/8*3,M7,T/8,H4,T/8,H7,T/8,                       H5,T/8*3,H1,T/8,H5,T/8,H1,T/8,H5,T/8,H1,T/8,                         L6,T/8*3,L6,T/16,L7,T/16,M1,T/8*3,L6,T/16,L7,T/16,
	M1,T/8*3,L7,T/16,L6,T/16,L7,T/4,L7,T/16,L3,T/16,M1,T/16,L7,T/16,   L6,T/4,L6,T/16,L6,T/16,L7,T/16,L6,T/16,M4,T/8*3,M3,T/16,M2,T/16,     M3,T/4,M1,T/8,M2,T/16,M1,T/16,M2,T/8*3,M3,T/8,                         
	M4,T/8*3,M3,T/16,M2,T/16,M7,T/8*3,M6,T/16,M5,T/16,                 M6,T/8*3,M5,T/16,M4,T/16,M5,T/4,M4,T/8,M3,T/8,                       M3,T/8,M4,T/8,M2,T/8*3,L7,T/8,M4,T/8,M7,T/8,
	M5,T/8*3,M1,T/8,M5,T/8,H1,T/8,M5,T/8,M1,T/8,                       M6,T/8*3,M7,T/16,M7,T/16*3,H1,T/16,H1,T/16*3,H5,T/16,H5,T/8,H6,T/8,  H6,T/16*3,H5,T/16,H5,T/2,H4,T/8,H3,T/8,   
	H3,T/16*3,H4,T/16,H2,T/2,H1,T/8,H7,T/8,                            M7,T/8,H1,T/8,M6,T/2,H1,T/16,M7,T/16,M6,T/16,M7,T/16,                H4,T/2,H4,T/8,H3,T/8,H2,T/8,H1,T/8,
	H2,T/8,H3,T/8,H1,T/4*3,                                            H4,T/8,H5,T/8,H6,T/8,H7,T/4,H2,T/4,                                  H1,T/4,H6,T/8*6,
	H4,T/2,H4,T/8,H3,T/8,H2,T/8,H1,T/8,                                H2,T/8,H3,T/8,H1,T/4*3,                                              H4,T/8,H5,T/8,H6,T/8,H1,T/4,H7,T/4,
	H1,T/8,H7,T/8,H6,T/2,H7,T/4,                                       M3,T/8*3,H1,T/16,H2,T/16,M6,T/8*3,H1,T/16,H2,T/16,                   M4,T/8*3,H2,T/16,H1,T/16,M5,T/8*3,H3,T/16,H2,T/16,
	M3,T/8*3,H2,T/16,H1,T/16,M1,T/8*3,H5,T/16,H4,T/16,                 M6,T/8*3,H4,T/16,H3,T/16,M5,T/4,H3,T/8,H4,T/8,                       M6,T/8*3,M7,T/8,M6,T/8,H4,T/8*3,H3,T/16,H2,T/16,
	H3,T/8*3,H2,T/16,H1,T/16,M7,T/4,H1,T/8,M7,T/8,                     M6,T/4,                                                              H6,T/1,H1,T/16,H3,T/16,H6,T/2

};


const int CastleInTheSky[]=
{
	M6, T/8, M7, T/8,            H1, T/4, M7, T/8, H1, T/4, H3, T/4,                 M7, T/2, M3, T/4,                 M6, T/4, M5, T/8, M6, T/4, H1, T/4,
	M5, T/2, M4, T/8, M3, T/8,     M4, T/8*3, M3, T/8, M4, T/4, H1, T/4,               M3, T/2, H1, T/8, H1, T/8, H1, T/8,   M7, T/8*3, M4, T/8, M4, T/4, M7, T/4,
	M7, T/2, M6, T/8, M7, T/8,     H1, T/8*3, M7, T/4, H1, T/4, H3, T/4,               M7, T/2, M3, T/8, M3, T/8,          M6, T/8*3, M5, T/8, M6, T/4, H1, T/4,
	M5, T/2, M3, T/4,            M4, T/4, H1, T/8, M7, T/8, M7, T/4, H1, T/4,          H2, T/4, H3, T/8, H1, T/8, H1, T/2,   H1, T/8, M7, T/8, M6, T/4, M7, T/4, M5, T/4,
	M6, T/4*3, H1, T/8, H2, T/8,   H3, T/8*3, H2, T/8, H3, T/4, H5, T/4,               H2, T/2, M5, T/8, M5, T/8,          H1, T/8*3, M7, T/8, H1, T/4, H3, T/4,
	H3, T/4*3,                 M6, T/8, M7, T/8, H1, T/4, M7, T/8, H1, T/8, H2, T/4,   H1, T/8*3, M5, T/8, M5, T/2,        H4, T/4, H3, T/4, H2, T/4, H1, T/4,
	H3, T,                     H3, T/4*3, H3, T/4,                             H6, T/2, H5, T/2,                 H3, T/4, H2, T/8, H1, T/8, H1, T/2,                     


};//A
#endif


